# Rows Iteration

In [2]:
import pandas as pd

data = {"a": [1, 2, 3, 4],
        "b": [4, 5, 6, 7],
        "c": ["sudh", "krish", "hitesh", "navin"]}

df = pd.DataFrame(data)
df

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin

#### iterrows():- It iterates each and every record of a dataset based on Rows.

In [3]:
df.iterrows()   #it returns a generator object which is used for iteration

In [4]:
for i in df.iterrows():
    print(i)

(0, a       1
b       4
c    sudh
Name: 0, dtype: object)
(1, a        2
b        5
c    krish
Name: 1, dtype: object)
(2, a         3
b         6
c    hitesh
Name: 2, dtype: object)
(3, a        4
b        7
c    navin
Name: 3, dtype: object)

#### iteritems() : It iterates the whole record based on Columns.

In [5]:
for i in df.iteritems():
    print(i)

('a', 0    1
1    2
2    3
3    4
Name: a, dtype: int64)
('b', 0    4
1    5
2    6
3    7
Name: b, dtype: int64)
('c', 0      sudh
1     krish
2    hitesh
3     navin
Name: c, dtype: object)

C:\Users\Gaurabh Chowdhury\AppData\Local\Temp\ipykernel_1216\36948316.py:1: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for i in df.iteritems():

.itertuples() :

In [117]:
for i in df.itertuples():
    print(i)

Pandas(Index=0, a=1, b=4, c='sudh')
Pandas(Index=1, a=2, b=5, c='krish')
Pandas(Index=2, a=3, b=6, c='hitesh')
Pandas(Index=3, a=4, b=7, c='navin')

In [119]:
df.sort_values

<bound method DataFrame.sort_values of    a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin>

#### Summation based on Column

In [6]:
def sum(x):
    return x.sum()

df.apply(sum,axis=0)

a                      10
b                      22
c    sudhkrishhiteshnavin
dtype: object

#### .applymap() method : It used for element-wise Operation. It can be used only with a Dataframe.

In [7]:
# Squaring the whole dataset

df2 = df[['a', 'b']]
df2.applymap(lambda i: i**2)

    a   b
0   1  16
1   4  25
2   9  36
3  16  49

#### Sorting the values of a column

In [8]:
# Sorting the values of 'c' column
df.sort_values('c')

   a  b       c
2  3  6  hitesh
1  2  5   krish
3  4  7   navin
0  1  4    sudh

#### Sorting based on Index

In [9]:
df.sort_index()     #By default it is sorted in ascending order

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin

In [10]:
# Sorting in descending order.
df.sort_index(ascending=False)

   a  b       c
3  4  7   navin
2  3  6  hitesh
1  2  5   krish
0  1  4    sudh

When we have a large number of data it could'nt be presented in the dataframe completely so to do this we have a method in pandas called .set_option() through which we can set the size of display.

In [11]:
pd.set_option('display.max_colwidth',1000)
df3 = pd.DataFrame({
    'desc':["Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.","my name is gaurav" , "i am learning data science mastes"]
})

In [12]:
df3

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            desc
0  Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.
1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              my name is gaurav
2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              i am learning data science mastes

In [13]:
# Calculating the length of each rows record

df3['char_length'] = df3['desc'].apply(len)

In [14]:
df3

,desc,char_length
0,"Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.",765
1,my name is gaurav,17
2,i am learning data science mastes,33

In [15]:
df3['Word_count'] = df3['desc'].apply(lambda i : len(i.split()))

In [16]:
df3

,desc,char_length,Word_count
0,"Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.",765,104
1,my name is gaurav,17,4
2,i am learning data science mastes,33,6

#### Some mathematical methods

In [17]:
df

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin

In [18]:
df['a'].mean()

2.5

In [19]:
df['b'].median()

5.5

In [20]:
df['a'].std()

1.2909944487358056

In [21]:
df['a'].min()

1

## Rolling Functions
* It is a very useful function in Pandas.
* It iterates or roll on each and every value of a column.
* Based on the window size it rolls/iterates over the column. For Example, if window size is 2, on each iteration it will take 2 data and perform the desired calculation.

In [22]:
df4 = pd.DataFrame({'a':[1,2,3,4,5,6,7,8,9]})
df4

   a
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9

In the below code, the size of window is 2 which means it takes 2 values from the column (first is the present value and second is the previous value) and perfrom the mean operation.

In [23]:
df4.rolling(window=2).mean()

     a
0  NaN
1  1.5
2  2.5
3  3.5
4  4.5
5  5.5
6  6.5
7  7.5
8  8.5

In [24]:
# Performing cummulative sum
df4.cumsum()

    a
0   1
1   3
2   6
3  10
4  15
5  21
6  28
7  36
8  45

## Date Functionality

#### Date Generation
pd.date_range() : it will generate a range of all dates between start and end point.

In [28]:
date = pd.date_range(start='2022-03-22',end='2022-06-22')

In [29]:
date

DatetimeIndex(['2022-03-22', '2022-03-23', '2022-03-24', '2022-03-25',
               '2022-03-26', '2022-03-27', '2022-03-28', '2022-03-29',
               '2022-03-30', '2022-03-31', '2022-04-01', '2022-04-02',
               '2022-04-03', '2022-04-04', '2022-04-05', '2022-04-06',
               '2022-04-07', '2022-04-08', '2022-04-09', '2022-04-10',
               '2022-04-11', '2022-04-12', '2022-04-13', '2022-04-14',
               '2022-04-15', '2022-04-16', '2022-04-17', '2022-04-18',
               '2022-04-19', '2022-04-20', '2022-04-21', '2022-04-22',
               '2022-04-23', '2022-04-24', '2022-04-25', '2022-04-26',
               '2022-04-27', '2022-04-28', '2022-04-29', '2022-04-30',
               '2022-05-01', '2022-05-02', '2022-05-03', '2022-05-04',
               '2022-05-05', '2022-05-06', '2022-05-07', '2022-05-08',
               '2022-05-09', '2022-05-10', '2022-05-11', '2022-05-12',
               '2022-05-13', '2022-05-14', '2022-05-15', '2022-05-16',
               '2022-05-17', '2022-05-18', '2022-05-19', '2022-05-20',
               '2022-05-21', '2022-05-22', '2022-05-23', '2022-05-24',
               '2022-05-25', '2022-05-26', '2022-05-27', '2022-05-28',
               '2022-05-29', '2022-05-30', '2022-05-31', '2022-06-01',
               '2022-06-02', '2022-06-03', '2022-06-04', '2022-06-05',
               '2022-06-06', '2022-06-07', '2022-06-08', '2022-06-09',
               '2022-06-10', '2022-06-11', '2022-06-12', '2022-06-13',
               '2022-06-14', '2022-06-15', '2022-06-16', '2022-06-17',
               '2022-06-18', '2022-06-19', '2022-06-20', '2022-06-21',
               '2022-06-22'],
              dtype='datetime64[ns]', freq='D')

In [35]:
df_date = pd.DataFrame(date,columns=['Date'])

In [36]:
df_date

         Date
0  2022-03-22
1  2022-03-23
2  2022-03-24
3  2022-03-25
4  2022-03-26
..        ...
88 2022-06-18
89 2022-06-19
90 2022-06-20
91 2022-06-21
92 2022-06-22

[93 rows x 1 columns]

In [37]:
df_date.dtypes

Date    datetime64[ns]
dtype: object

* In real time projects, we may encounter dates in our datasets. So if the type of the dates are string we can't perform some task. So first of all we have to convert it to datetime64 datatype.

In [42]:
df5 = pd.DataFrame({'date' : ['2022-06-22','2022-06-21','2022-06-20']})
df5

         date
0  2022-06-22
1  2022-06-21
2  2022-06-20

In [43]:
df5.dtypes

date    object
dtype: object

In [46]:
# Converting the dates from string type to datatime64 datatype

df5['updated_date'] = pd.to_datetime(df5['date'])
df5

         date updated_date
0  2022-06-22   2022-06-22
1  2022-06-21   2022-06-21
2  2022-06-20   2022-06-20

In [47]:
df5.dtypes

date                    object
updated_date    datetime64[ns]
dtype: object

* Storing the date, month and year in seperate column

In [73]:
df5['Year'] = df5['updated_date'].dt.year
df5['Month'] = df5['updated_date'].dt.month
df5['Day'] = df5['updated_date'].dt.day

In [74]:
df5

         date updated_date  Year  Month  Day
0  2022-06-22   2022-06-22  2022      6   22
1  2022-06-21   2022-06-21  2022      6   21
2  2022-06-20   2022-06-20  2022      6   20

#### Time Delta

* pd.Timedelta() : It return the duration between two dates or time.

In [86]:
time = pd.Timedelta(days=3,hours=5,minutes=56,seconds=15)

In [87]:
dt = pd.to_datetime('2022-06-21')

In [89]:
dt + time

# Here simply the date is add with timedelta date which is 3 days, 5 hours, 56 minutes, 15 seconds

Timestamp('2022-06-24 05:56:15')

In [107]:
def add_date(x):
    t = pd.Timedelta(days=3,hours=3,minutes=56,seconds=15)
    return t+x

df5['Added_Date'] = df5['updated_date'].apply(lambda i : add_date(i))

In [111]:
df5

         date updated_date  Year  Month  Day          Added_Date
0  2022-06-22   2022-06-22  2022      6   22 2022-06-25 03:56:15
1  2022-06-21   2022-06-21  2022      6   21 2022-06-24 03:56:15
2  2022-06-20   2022-06-20  2022      6   20 2022-06-23 03:56:15

#### Categorical Data

In [112]:
d = [9,2,1,9,4,3,4]

In [113]:
c = pd.Categorical(d)
c.value_counts()

1    1
2    1
3    1
4    2
9    2
dtype: int64

In [120]:
dff = pd.DataFrame({'date' : ['2022-06-22','2022-06-21','2022-06-20']})
dff

         date
0  2022-06-22
1  2022-06-21
2  2022-06-20

In [121]:
dff['date'] = pd.to_datetime(dff['date'])

In [124]:
dff['Month'] = dff['date'].dt.month

In [125]:
dff

        date  Month
0 2022-06-22      6
1 2022-06-21      6
2 2022-06-20      6